In [1]:
import pandas as pda
nba=pda.read_csv('nbasalaries.csv')
nba.head()

   Unnamed: 0  RK           Player                 TEAM        SALARY
0           0   1      Kobe Bryant   Los Angeles Lakers  $25,000,000
1           1   2     LeBron James  Cleveland Cavaliers           NaN
2           2   3  Carmelo Anthony                  NaN  $22,875,000
3           3   4    Dwight Howard      Houston Rockets  $22,359,364
4           4   5       Chris Bosh           Miami Heat           NaN

In [2]:
mask=nba["RK"].between(1,5)
nba[mask]

   Unnamed: 0  RK           Player                 TEAM        SALARY
0           0   1      Kobe Bryant   Los Angeles Lakers  $25,000,000
1           1   2     LeBron James  Cleveland Cavaliers           NaN
2           2   3  Carmelo Anthony                  NaN  $22,875,000
3           3   4    Dwight Howard      Houston Rockets  $22,359,364
4           4   5       Chris Bosh           Miami Heat           NaN

TypeError: between() takes from 3 to 4 positional arguments but 7 were given